tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# CLI
brew "git"
brew "bun"
brew "pnpm"
brew "orbstack"
brew "docker"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# GUI
cask "ghostty"
cask "visual-studio-code"
cask "google-chrome"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

# Productivity & Utilities
cask "appcleaner"
cask "1password"
cask "raycast"

# Notes & Music
cask "obsidian"
cask "spotify"

# JetBrains IDEs
cask "phpstorm"

# Laravel Herd
+cask "laravel-herd"